# Brewfile.apps — GUI 앱 (Cask) + Mac App Store (mas)
# 사용법:
#   make brew-apps
#
# 사전 요구:
# - Brewfile (코어) 가 먼저 적용되어 있어야 함 — mas 가 Brewfile 에 있음
# - mas 항목 사용 시 App Store 에 미리 로그인 필요
#
# 정책:
# - 주석 (#) 해제된 항목 = 현재 장비에 설치되어 있고 자동 동기화 대상
# - 주석된 항목 = 새 장비에서 필요할 때 주석 해제 후 make brew-apps 실행

#--------------------------------------------------------------------------
# 현재 사용 중 (자동 설치)
#--------------------------------------------------------------------------

# Command-line interface for 1Password
cask "1password-cli"
# Nerd Font (터미널 / 에디터 폰트)
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"

#--------------------------------------------------------------------------
# 협업 / 메신저 (선택)
#--------------------------------------------------------------------------

cask "slack"
cask "notion"
cask "zoom"

#--------------------------------------------------------------------------
# 개발 도구 (선택)
#--------------------------------------------------------------------------

cask "jetbrains-toolbox"
cask "docker"
cask "postman"
cask "figma"

#--------------------------------------------------------------------------
# AI / 보조 도구 (선택)
#--------------------------------------------------------------------------

cask "claude"
cask "chatgpt"
cask "codex-app"

#--------------------------------------------------------------------------
# 유틸리티 (선택)
#--------------------------------------------------------------------------

cask "1password"
cask "rectangle"
cask "alfred"

#--------------------------------------------------------------------------
# 브라우저 / 문서 (선택)
#--------------------------------------------------------------------------

cask "google-chrome"
cask "obsidian"

#--------------------------------------------------------------------------
# 터미널 / 키보드 (선택 — 이미 설정 디렉토리 보유)
#--------------------------------------------------------------------------

cask "karabiner-elements"

#--------------------------------------------------------------------------
# Mac App Store (수동 설치 권장)
#
# mas-cli 의 알려진 한계: macOS Big Sur+ 에서 "이미 다운받은 적 있는 앱" 은
# install 시 "구매할 수 없다" 에러가 나옴 (Apple private API 제한).
# 새 장비 셋업 시에는 App Store 에서 아래 앱들을 직접 다운로드하세요.
#
# 앱 ID 확인: mas search "<앱 이름>"
#--------------------------------------------------------------------------

# mas "KakaoTalk", id: 869223134
# mas "RunCat", id: 1429033973
